baseedt/src/Documents/СообщениеSMS/СообщениеSMS.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>СообщениеSMS</name>
  <basedOn>Document.Встреча</basedOn>
  <basedOn>Document.ЗапланированноеВзаимодействие</basedOn>
  <basedOn>Document.ТелефонныйЗвонок</basedOn>
  <basedOn>Document.ЭлектронноеПисьмоВходящее</basedOn>
  <basedOn>Document.ЭлектронноеПисьмоИсходящее</basedOn>
  <basedOn>Document.СообщениеSMS</basedOn>
  <posting>Deny</posting>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Важность</name>
    <type>
      <types>EnumRef.ВариантыВажностиВзаимодействия</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>СписокУчастников</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВзаимодействиеОснование</name>
    <type>
      <types>DocumentRef.ЭлектронноеПисьмоИсходящее</types>
      <types>DocumentRef.ЗапланированноеВзаимодействие</types>
      <types>DocumentRef.ЭлектронноеПисьмоВходящее</types>
      <types>DocumentRef.ТелефонныйЗвонок</types>
      <types>DocumentRef.Встреча</types>
      <types>DocumentRef.СообщениеSMS</types>
    </type>
  </attributes>
  <attributes>
    <name>Тема</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтправлятьВТранслите</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТекстСообщения</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Состояние</name>
    <type>
      <types>EnumRef.СостоянияДокументаСообщениеSMS</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаКогдаОтправить</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаАктуальностиОтправки</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Адресаты</name>
    <attributes>
      <name>Контакт</name>
      <type>
        <types>DefinedType.КонтактВзаимодействия</types>
      </type>
    </attributes>
    <attributes>
      <name>ПредставлениеКонтакта</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КакСвязаться</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерДляОтправки</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>30</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИдентификаторСообщения</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТекстОшибки</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СостояниеСообщения</name>
      <type>
        <types>EnumRef.СостоянияСообщенияSMS</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>НаборыЗначенийДоступа</name>
    <attributes>
      <name>НомерНабора</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>4</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗначениеДоступа</name>
      <comment>Незаполненные значения нужно допустить, чтобы избежать ошибок при записи проверяемых объектов</comment>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Уточнение</name>
      <type>
        <types>CatalogRef.ИдентификаторыОбъектовМетаданных</types>
      </type>
    </attributes>
    <attributes>
      <name>Чтение</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Изменение</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

baseedt/src/Documents/ТелефонныйЗвонок/ТелефонныйЗвонок.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ТелефонныйЗвонок</name>
  <basedOn>Document.Встреча</basedOn>
  <basedOn>Document.ТелефонныйЗвонок</basedOn>
  <basedOn>Document.ЭлектронноеПисьмоВходящее</basedOn>
  <basedOn>Document.ЭлектронноеПисьмоИсходящее</basedOn>
  <basedOn>Document.ЗапланированноеВзаимодействие</basedOn>
  <basedOn>Document.СообщениеSMS</basedOn>
  <posting>Deny</posting>
  <attributes>
    <name>АбонентКакСвязаться</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>АбонентКонтакт</name>
    <type>
      <types>DefinedType.КонтактВзаимодействия</types>
    </type>
  </attributes>
  <attributes>
    <name>АбонентПредставление</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Важность</name>
    <type>
      <types>EnumRef.ВариантыВажностиВзаимодействия</types>
    </type>
  </attributes>
  <attributes>
    <name>Входящий</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ВзаимодействиеОснование</name>
    <type>
      <types>DocumentRef.ЭлектронноеПисьмоИсходящее</types>
      <types>DocumentRef.ЗапланированноеВзаимодействие</types>
      <types>DocumentRef.ЭлектронноеПисьмоВходящее</types>
      <types>DocumentRef.ТелефонныйЗвонок</types>
      <types>DocumentRef.Встреча</types>
      <types>DocumentRef.СообщениеSMS</types>
    </type>
  </attributes>
  <attributes>
    <name>Тема</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>НаборыЗначенийДоступа</name>
    <attributes>
      <name>НомерНабора</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>4</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗначениеДоступа</name>
      <comment>Незаполненные значения нужно допустить, чтобы избежать ошибок при записи проверяемых объектов</comment>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Уточнение</name>
      <type>
        <types>CatalogRef.ИдентификаторыОбъектовМетаданных</types>
      </type>
    </attributes>
    <attributes>
      <name>Чтение</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Изменение</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

baseedt/src/Catalogs/Пользователи/Пользователи.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Пользователи</name>
  <comment>АПК:413 - №744.2.1.1 Допустимо не отключать историю выбора, так как она используется, а переопределение отбора фиксированное, то есть служебные и недействительные пользователи в нее не попадут, но если как-то попали, то это не является проблемой</comment>
  <attributes>
    <name>Недействителен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>DefinedType.Подразделение</types>
    </type>
  </attributes>
  <attributes>
    <name>ФизическоеЛицо</name>
    <type>
      <types>DefinedType.ФизическоеЛицо</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Служебный</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Подготовлен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторПользователяИБ</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторПользователяСервиса</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <attributes>
    <name>СвойстваПользователяИБ</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>Фотография</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>СсылкаНаФотографию</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>КонтактнаяИнформация</name>
    <attributes>
      <name>Тип</name>
      <type>
        <types>EnumRef.ТипыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Вид</name>
      <type>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Представление</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗначенияПолей</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Страна</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Регион</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Город</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АдресЭП</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДоменноеИмяСервера</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефона</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефонаБезКодов</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВидДляСписка</name>
      <type>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

baseedt/src/CommonModules/react_Взаимодействия/Module.bsl
Функция ПолучитьВзаимодействия(ЗапросHTTP) Экспорт
	
	Идентификатор = ЗапросHTTP.ПараметрыЗапроса.Получить("uuid");
	ТипДокумента  = ЗапросHTTP.ПараметрыЗапроса.Получить("type");
	
	Если ЗначениеЗаполнено(Идентификатор) И ЗначениеЗаполнено(ТипДокумента) Тогда
		Возврат ПолучитьВзаимодействиеПоUUID(Идентификатор, ТипДокумента)	
	Иначе
		Возврат ПолучитьВсеВзаимодействия();
	КонецЕсли;
		
КонецФункции

Функция ПолучитьВсеВзаимодействия() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Взаимодействия.Ссылка КАК uuid,
		|	Взаимодействия.Номер КАК num,
		|	Взаимодействия.Дата КАК date,
		|	Взаимодействия.Автор.Представление КАК author,
		|	Взаимодействия.Важность КАК importance,
		|	Взаимодействия.Тема КАК theme
		|ИЗ
		|	ЖурналДокументов.Взаимодействия КАК Взаимодействия";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	ОбщаяСтруктураВзаимодействий = Новый Структура;
	
	МассивВзаимодействий = Новый Массив;
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		СтруктураВзаимодействия = Новый Структура;
		
		СтруктураВзаимодействия.Вставить("uuid", XMLСтрока(ВыборкаДетальныеЗаписи.uuid));
		СтруктураВзаимодействия.Вставить("num", ВыборкаДетальныеЗаписи.num);
		СтруктураВзаимодействия.Вставить("date", Формат(ВыборкаДетальныеЗаписи.date, "ДЛФ=DT"));
		СтруктураВзаимодействия.Вставить("author", ВыборкаДетальныеЗаписи.author);
		СтруктураВзаимодействия.Вставить("importance", XMLСтрока(ВыборкаДетальныеЗаписи.importance));
		СтруктураВзаимодействия.Вставить("theme", ВыборкаДетальныеЗаписи.theme);
		
		ТипДокумента = react_ОбщегоНазначения.ПолучитьТипВзаимодействия(ВыборкаДетальныеЗаписи.uuid);
		СтруктураВзаимодействия.Вставить("typeBack", ТипДокумента.typeBack);
		СтруктураВзаимодействия.Вставить("type", ТипДокумента.type);
		СтруктураВзаимодействия.Вставить("frontDocName", ТипДокумента.frontDocName);
		
		МассивВзаимодействий.Добавить(СтруктураВзаимодействия);
	КонецЦикла;
	
	ОбщаяСтруктураВзаимодействий.Вставить("actions", МассивВзаимодействий);
	
	Возврат react_ОбщегоНазначения.МассивСтруктурВJSON(ОбщаяСтруктураВзаимодействий);
	
КонецФункции

Функция ПолучитьВзаимодействиеПоUUID(uuid, ТипДокумента) Экспорт
	
	Идентификатор = Новый УникальныйИдентификатор(uuid);
	
	Ссылка = Документы[ТипДокумента].ПолучитьСсылку(Идентификатор);
	
	Если ТипЗнч(Ссылка) = Тип("ДокументСсылка.Встреча") Тогда
	    Возврат ПолучитьДокументыВстреча(Ссылка);
	ИначеЕсли ТипЗнч(Ссылка) = Тип("ДокументСсылка.ЗапланированноеВзаимодействие") Тогда
		Возврат ПолучитьДокументыЗапланированноеВзаимодействие(Ссылка);	
	ИначеЕсли ТипЗнч(Ссылка) = Тип("ДокументСсылка.СообщениеSMS") Тогда
		Возврат ПолучитьДокументыСообщениеSMS(Ссылка);
	ИначеЕсли ТипЗнч(Ссылка) = Тип("ДокументСсылка.ТелефонныйЗвонок") Тогда
		Возврат ПолучитьДокументыТелефонныйЗвонок(Ссылка);
	ИначеЕсли ТипЗнч(Ссылка) = Тип("ДокументСсылка.ЭлектронноеПисьмоВходящее") Тогда
		Возврат ПолучитьДокументыЭлектронноеПисьмоВходящее(Ссылка);
	ИначеЕсли ТипЗнч(Ссылка) = Тип("ДокументСсылка.ЭлектронноеПисьмоИсходящее") Тогда
	    Возврат ПолучитьДокументыЭлектронноеПисьмоИсходящее(Ссылка);
	КонецЕсли;
		
КонецФункции

#Область ПолучениеДокументов

//done
Функция ПолучитьДокументыВстреча(Ссылка = Неопределено) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Встреча.Ссылка КАК uuid,
		|	Встреча.Номер КАК num,
		|	Встреча.Дата КАК date,
		|	Встреча.Автор.Представление КАК author,
		|	Встреча.Важность КАК importance,
		|	Встреча.ДатаНачала КАК date_beginning,
		|	Встреча.ДатаОкончания КАК date_ending,
		|	Встреча.МестоПроведенияВстречи КАК meeting_place,
		|	Встреча.Описание КАК description,
		|	Встреча.Ответственный.Представление КАК responsible,
		|	Встреча.СписокУчастников КАК members_list,
		|	Встреча.ВзаимодействиеОснование.Представление КАК actions_basis_representation,
		|	Встреча.ВзаимодействиеОснование КАК actions_basis,
		|	Встреча.Тема КАК theme,
		|	Встреча.Комментарий КАК comment,
		|	Встреча.Представление КАК representation
		|ИЗ
		|	Документ.Встреча КАК Встреча";
		Если НЕ Ссылка = Неопределено Тогда
			Запрос.Текст = Запрос.Текст + "	
				|ГДЕ
				|	Встреча.Ссылка = &Ссылка
				|	И НЕ Встреча.ПометкаУдаления";	
			Запрос.УстановитьПараметр("Ссылка", Ссылка);
		КонецЕсли;
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	ОбщаяСтруктураВзаимодействий = Новый Структура;
	
	МассивВзаимодействий = Новый Массив;
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		СтруктураВзаимодействия = Новый Структура;
		
		СтруктураВзаимодействия.Вставить("uuid", XMLСтрока(ВыборкаДетальныеЗаписи.uuid));
		СтруктураВзаимодействия.Вставить("num", ВыборкаДетальныеЗаписи.num);
		СтруктураВзаимодействия.Вставить("date", Формат(ВыборкаДетальныеЗаписи.date, "ДЛФ=DT"));
		СтруктураВзаимодействия.Вставить("dateISO", XMLСтрока(ВыборкаДетальныеЗаписи.date));
		СтруктураВзаимодействия.Вставить("author", XMLСтрока(ВыборкаДетальныеЗаписи.author));
		СтруктураВзаимодействия.Вставить("importance", XMLСтрока(ВыборкаДетальныеЗаписи.importance));
		
		СтруктураВзаимодействия.Вставить("date_beginning", Формат(ВыборкаДетальныеЗаписи.date_beginning, "ДЛФ=DT"));
		СтруктураВзаимодействия.Вставить("date_ending", Формат(ВыборкаДетальныеЗаписи.date_ending, "ДЛФ=DT"));
		СтруктураВзаимодействия.Вставить("meeting_place", ВыборкаДетальныеЗаписи.meeting_place);
		СтруктураВзаимодействия.Вставить("description", ВыборкаДетальныеЗаписи.description);
		СтруктураВзаимодействия.Вставить("responsible", XMLСтрока(ВыборкаДетальныеЗаписи.responsible));
		СтруктураВзаимодействия.Вставить("members_list", ВыборкаДетальныеЗаписи.members_list);
		СтруктураВзаимодействия.Вставить("actions_basis", XMLСтрока(ВыборкаДетальныеЗаписи.actions_basis));
		СтруктураВзаимодействия.Вставить("actions_basis_representation", XMLСтрока(ВыборкаДетальныеЗаписи.actions_basis_representation));
		СтруктураВзаимодействия.Вставить("theme", ВыборкаДетальныеЗаписи.theme);		
		СтруктураВзаимодействия.Вставить("comment", ВыборкаДетальныеЗаписи.comment);
		СтруктураВзаимодействия.Вставить("representation", ВыборкаДетальныеЗаписи.representation);
		
		ТипДокумента = react_ОбщегоНазначения.ПолучитьТипВзаимодействия(ВыборкаДетальныеЗаписи.uuid);
		СтруктураВзаимодействия.Вставить("typeBack", ТипДокумента.typeBack);
		СтруктураВзаимодействия.Вставить("type", ТипДокумента.type);
		СтруктураВзаимодействия.Вставить("frontDocName", ТипДокумента.frontDocName);
		
		МассивВзаимодействий.Добавить(СтруктураВзаимодействия);
	КонецЦикла;
	
	ОбщаяСтруктураВзаимодействий.Вставить("actions", МассивВзаимодействий);
	
	Возврат react_ОбщегоНазначения.МассивСтруктурВJSON(ОбщаяСтруктураВзаимодействий);
	
КонецФункции

//done
Функция ПолучитьДокументыЗапланированноеВзаимодействие(Ссылка = Неопределено) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЗапланированноеВзаимодействие.Ссылка КАК uuid,
		|	ЗапланированноеВзаимодействие.Номер КАК num,
		|	ЗапланированноеВзаимодействие.Дата КАК date,
		|	ЗапланированноеВзаимодействие.Автор.Представление КАК author,
		|	ЗапланированноеВзаимодействие.Важность КАК importance,
		|	ЗапланированноеВзаимодействие.Описание КАК description,
		|	ЗапланированноеВзаимодействие.Ответственный.Представление КАК responsible,
		|	ЗапланированноеВзаимодействие.СписокУчастников КАК members_list,
		|	ЗапланированноеВзаимодействие.ВзаимодействиеОснование.Представление КАК actions_basis,
		|	ЗапланированноеВзаимодействие.Тема КАК theme,
		|	ЗапланированноеВзаимодействие.Комментарий КАК comment,
		|	ЗапланированноеВзаимодействие.Представление КАК representation
		|ИЗ
		|	Документ.ЗапланированноеВзаимодействие КАК ЗапланированноеВзаимодействие";
		Если НЕ Ссылка = Неопределено Тогда
			Запрос.Текст = Запрос.Текст + "	
				|ГДЕ
				|	ЗапланированноеВзаимодействие.Ссылка = &Ссылка
				|	И НЕ ЗапланированноеВзаимодействие.ПометкаУдаления";	
			Запрос.УстановитьПараметр("Ссылка", Ссылка);
		КонецЕсли;
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	ОбщаяСтруктураВзаимодействий = Новый Структура;
	
	МассивВзаимодействий = Новый Массив;
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		СтруктураВзаимодействия = Новый Структура;
		
		СтруктураВзаимодействия.Вставить("uuid", XMLСтрока(ВыборкаДетальныеЗаписи.uuid));
		СтруктураВзаимодействия.Вставить("num", ВыборкаДетальныеЗаписи.num);
		СтруктураВзаимодействия.Вставить("date", Формат(ВыборкаДетальныеЗаписи.date, "ДЛФ=DT"));
		СтруктураВзаимодействия.Вставить("author", XMLСтрока(ВыборкаДетальныеЗаписи.author));
		СтруктураВзаимодействия.Вставить("importance", XMLСтрока(ВыборкаДетальныеЗаписи.importance));
		
		СтруктураВзаимодействия.Вставить("description", ВыборкаДетальныеЗаписи.description);
		СтруктураВзаимодействия.Вставить("responsible", XMLСтрока(ВыборкаДетальныеЗаписи.responsible));
		СтруктураВзаимодействия.Вставить("members_list", ВыборкаДетальныеЗаписи.members_list);
		СтруктураВзаимодействия.Вставить("actions_basis", XMLСтрока(ВыборкаДетальныеЗаписи.actions_basis));	
		СтруктураВзаимодействия.Вставить("theme", ВыборкаДетальныеЗаписи.theme);		
		СтруктураВзаимодействия.Вставить("comment", ВыборкаДетальныеЗаписи.comment);
		СтруктураВзаимодействия.Вставить("representation", ВыборкаДетальныеЗаписи.representation);
		
		ТипДокумента = react_ОбщегоНазначения.ПолучитьТипВзаимодействия(ВыборкаДетальныеЗаписи.uuid);
		СтруктураВзаимодействия.Вставить("typeBack", ТипДокумента.typeBack);
		СтруктураВзаимодействия.Вставить("type", ТипДокумента.type);
		СтруктураВзаимодействия.Вставить("frontDocName", ТипДокумента.frontDocName);
		
		МассивВзаимодействий.Добавить(СтруктураВзаимодействия);
	КонецЦикла;
	
	ОбщаяСтруктураВзаимодействий.Вставить("actions", МассивВзаимодействий);
	
	Возврат react_ОбщегоНазначения.МассивСтруктурВJSON(ОбщаяСтруктураВзаимодействий);
	
КонецФункции

//done
Функция ПолучитьДокументыСообщениеSMS(Ссылка = Неопределено) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СообщениеSMS.Ссылка КАК uuid,
		|	СообщениеSMS.Номер КАК num,
		|	СообщениеSMS.Дата КАК date,
		|	СообщениеSMS.Автор.Представление КАК author,
		|	СообщениеSMS.Важность КАК importance,
		|	СообщениеSMS.Ответственный.Представление КАК responsible,
		|	СообщениеSMS.СписокУчастников КАК members_list,
		|	СообщениеSMS.ВзаимодействиеОснование.Представление КАК actions_basis,
		|	СообщениеSMS.Тема КАК theme,
		|	СообщениеSMS.Комментарий КАК comment,
		|	СообщениеSMS.Представление КАК representation,
		|	СообщениеSMS.ТекстСообщения КАК text_message,
		|	СообщениеSMS.Состояние КАК status
		|ИЗ
		|	Документ.СообщениеSMS КАК СообщениеSMS";
		Если НЕ Ссылка = Неопределено Тогда
			Запрос.Текст = Запрос.Текст + "	
				|ГДЕ
				|	СообщениеSMS.Ссылка = &Ссылка
				|	И НЕ СообщениеSMS.ПометкаУдаления";	
			Запрос.УстановитьПараметр("Ссылка", Ссылка);
		КонецЕсли;
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	ОбщаяСтруктураВзаимодействий = Новый Структура;
	
	МассивВзаимодействий = Новый Массив;
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		СтруктураВзаимодействия = Новый Структура;
		
		СтруктураВзаимодействия.Вставить("uuid", XMLСтрока(ВыборкаДетальныеЗаписи.uuid));
		СтруктураВзаимодействия.Вставить("num", ВыборкаДетальныеЗаписи.num);
		СтруктураВзаимодействия.Вставить("date", Формат(ВыборкаДетальныеЗаписи.date, "ДЛФ=DT"));
		СтруктураВзаимодействия.Вставить("author", XMLСтрока(ВыборкаДетальныеЗаписи.author));
		СтруктураВзаимодействия.Вставить("importance", XMLСтрока(ВыборкаДетальныеЗаписи.importance));
		
		СтруктураВзаимодействия.Вставить("responsible", XMLСтрока(ВыборкаДетальныеЗаписи.responsible));
		СтруктураВзаимодействия.Вставить("members_list", ВыборкаДетальныеЗаписи.members_list);
		СтруктураВзаимодействия.Вставить("actions_basis", XMLСтрока(ВыборкаДетальныеЗаписи.actions_basis));	
		СтруктураВзаимодействия.Вставить("theme", ВыборкаДетальныеЗаписи.theme);		
		СтруктураВзаимодействия.Вставить("comment", ВыборкаДетальныеЗаписи.comment);
		СтруктураВзаимодействия.Вставить("representation", ВыборкаДетальныеЗаписи.representation);
		СтруктураВзаимодействия.Вставить("text_message", ВыборкаДетальныеЗаписи.text_message);
		СтруктураВзаимодействия.Вставить("status", XMLСтрока(ВыборкаДетальныеЗаписи.status));
		
		ТипДокумента = react_ОбщегоНазначения.ПолучитьТипВзаимодействия(ВыборкаДетальныеЗаписи.uuid);
		СтруктураВзаимодействия.Вставить("typeBack", ТипДокумента.typeBack);
		СтруктураВзаимодействия.Вставить("type", ТипДокумента.type);
		СтруктураВзаимодействия.Вставить("frontDocName", ТипДокумента.frontDocName);
		
		МассивВзаимодействий.Добавить(СтруктураВзаимодействия);
	КонецЦикла;
	
	ОбщаяСтруктураВзаимодействий.Вставить("actions", МассивВзаимодействий);
	
	Возврат react_ОбщегоНазначения.МассивСтруктурВJSON(ОбщаяСтруктураВзаимодействий);
	
КонецФункции

//done
Функция ПолучитьДокументыТелефонныйЗвонок(Ссылка = Неопределено) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТелефонныйЗвонок.Ссылка КАК uuid,
		|	ТелефонныйЗвонок.Номер КАК num,
		|	ТелефонныйЗвонок.Дата КАК date,
		|	ТелефонныйЗвонок.Автор.Представление КАК author,
		|	ТелефонныйЗвонок.Важность КАК importance,
		|	ТелефонныйЗвонок.Описание КАК description,
		|	ТелефонныйЗвонок.Ответственный.Представление КАК responsible,
		|	ТелефонныйЗвонок.ВзаимодействиеОснование.Представление КАК actions_basis,
		|	ТелефонныйЗвонок.Тема КАК theme,
		|	ТелефонныйЗвонок.Комментарий КАК comment,
		|	ТелефонныйЗвонок.Представление КАК representation,
		|	ТелефонныйЗвонок.АбонентКакСвязаться КАК reach_method,
		|	ТелефонныйЗвонок.АбонентКонтакт.Представление КАК contact,
		|	ТелефонныйЗвонок.Входящий КАК incoming
		|ИЗ
		|	Документ.ТелефонныйЗвонок КАК ТелефонныйЗвонок";
		Если НЕ Ссылка = Неопределено Тогда
			Запрос.Текст = Запрос.Текст + "	
				|ГДЕ
				|	ТелефонныйЗвонок.Ссылка = &Ссылка
				|	И НЕ ТелефонныйЗвонок.ПометкаУдаления";	
			Запрос.УстановитьПараметр("Ссылка", Ссылка);
		КонецЕсли;
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	ОбщаяСтруктураВзаимодействий = Новый Структура;
	
	МассивВзаимодействий = Новый Массив;
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		СтруктураВзаимодействия = Новый Структура;
		
		СтруктураВзаимодействия.Вставить("uuid", XMLСтрока(ВыборкаДетальныеЗаписи.uuid));
		СтруктураВзаимодействия.Вставить("num", ВыборкаДетальныеЗаписи.num);
		СтруктураВзаимодействия.Вставить("date", Формат(ВыборкаДетальныеЗаписи.date, "ДЛФ=DT"));
		СтруктураВзаимодействия.Вставить("author", XMLСтрока(ВыборкаДетальныеЗаписи.author));
		СтруктураВзаимодействия.Вставить("importance", XMLСтрока(ВыборкаДетальныеЗаписи.importance));
		
		СтруктураВзаимодействия.Вставить("description", ВыборкаДетальныеЗаписи.description);
		СтруктураВзаимодействия.Вставить("responsible", XMLСтрока(ВыборкаДетальныеЗаписи.responsible));
		СтруктураВзаимодействия.Вставить("actions_basis", XMLСтрока(ВыборкаДетальныеЗаписи.actions_basis));	
		СтруктураВзаимодействия.Вставить("theme", ВыборкаДетальныеЗаписи.theme);		
		СтруктураВзаимодействия.Вставить("comment", ВыборкаДетальныеЗаписи.comment);
		СтруктураВзаимодействия.Вставить("representation", ВыборкаДетальныеЗаписи.representation);
		СтруктураВзаимодействия.Вставить("reach_method", ВыборкаДетальныеЗаписи.reach_method);
		СтруктураВзаимодействия.Вставить("contact", XMLСтрока(ВыборкаДетальныеЗаписи.contact));
		СтруктураВзаимодействия.Вставить("incoming", XMLСтрока(ВыборкаДетальныеЗаписи.incoming));
		
		ТипДокумента = react_ОбщегоНазначения.ПолучитьТипВзаимодействия(ВыборкаДетальныеЗаписи.uuid);
		СтруктураВзаимодействия.Вставить("typeBack", ТипДокумента.typeBack);
		СтруктураВзаимодействия.Вставить("type", ТипДокумента.type);
		СтруктураВзаимодействия.Вставить("frontDocName", ТипДокумента.frontDocName);
		
		МассивВзаимодействий.Добавить(СтруктураВзаимодействия);
	КонецЦикла;
	
	ОбщаяСтруктураВзаимодействий.Вставить("actions", МассивВзаимодействий);
	
	Возврат react_ОбщегоНазначения.МассивСтруктурВJSON(ОбщаяСтруктураВзаимодействий);
	
КонецФункции

//-
Функция ПолучитьДокументыЭлектронноеПисьмоВходящее(Ссылка = Неопределено) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Встреча.Ссылка КАК uuid,
		|	Встреча.Номер КАК num,
		|	Встреча.Дата КАК date,
		|	Встреча.Автор КАК author,
		|	Встреча.Важность КАК importance,
		|	Встреча.ДатаНачала КАК date_beginning,
		|	Встреча.ДатаОкончания КАК date_ending,
		|	Встреча.МестоПроведенияВстречи КАК meeting_place,
		|	Встреча.Описание КАК description,
		|	Встреча.Ответственный КАК responsible,
		|	Встреча.СписокУчастников КАК members_list,
		|	Встреча.ВзаимодействиеОснование КАК actions_basis,
		|	Встреча.Тема КАК theme,
		|	Встреча.Комментарий КАК comment,
		|	Встреча.Представление КАК representation
		|ИЗ
		|	Документ.Встреча КАК Встреча";
		Если НЕ Ссылка = Неопределено Тогда
			Запрос.Текст = Запрос.Текст + "	
				|ГДЕ
				|	Встреча.Ссылка = &Ссылка
				|	И НЕ Встреча.ПометкаУдаления";	
			Запрос.УстановитьПараметр("Ссылка", Ссылка);
		КонецЕсли;
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	ОбщаяСтруктураВзаимодействий = Новый Структура;
	
	МассивВзаимодействий = Новый Массив;
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		СтруктураВзаимодействия = Новый Структура;
		
		СтруктураВзаимодействия.Вставить("uuid", XMLСтрока(ВыборкаДетальныеЗаписи.uuid));
		СтруктураВзаимодействия.Вставить("num", ВыборкаДетальныеЗаписи.num);
		СтруктураВзаимодействия.Вставить("date", Формат(ВыборкаДетальныеЗаписи.date, "ДЛФ=DT"));
		СтруктураВзаимодействия.Вставить("author", ВыборкаДетальныеЗаписи.author);
		СтруктураВзаимодействия.Вставить("importance", XMLСтрока(ВыборкаДетальныеЗаписи.importance));
		
		СтруктураВзаимодействия.Вставить("date_beginning", Формат(ВыборкаДетальныеЗаписи.date_beginning, "ДЛФ=DT"));
		СтруктураВзаимодействия.Вставить("date_ending", Формат(ВыборкаДетальныеЗаписи.date_ending, "ДЛФ=DT"));
		СтруктураВзаимодействия.Вставить("meeting_place", ВыборкаДетальныеЗаписи.meeting_place);
		СтруктураВзаимодействия.Вставить("description", ВыборкаДетальныеЗаписи.description);
		СтруктураВзаимодействия.Вставить("responsible", Строка(ВыборкаДетальныеЗаписи.responsible));
		СтруктураВзаимодействия.Вставить("members_list", ВыборкаДетальныеЗаписи.members_list);
		СтруктураВзаимодействия.Вставить("actions_basis", Строка(ВыборкаДетальныеЗаписи.actions_basis));	
		СтруктураВзаимодействия.Вставить("theme", ВыборкаДетальныеЗаписи.theme);		
		СтруктураВзаимодействия.Вставить("comment", ВыборкаДетальныеЗаписи.comment);
		СтруктураВзаимодействия.Вставить("representation", ВыборкаДетальныеЗаписи.representation);
		
		ТипДокумента = react_ОбщегоНазначения.ПолучитьТипВзаимодействия(ВыборкаДетальныеЗаписи.uuid);
		СтруктураВзаимодействия.Вставить("typeBack", ТипДокумента.typeBack);
		СтруктураВзаимодействия.Вставить("type", ТипДокумента.type);
		СтруктураВзаимодействия.Вставить("frontDocName", ТипДокумента.frontDocName);
		
		МассивВзаимодействий.Добавить(СтруктураВзаимодействия);
	КонецЦикла;
	
	ОбщаяСтруктураВзаимодействий.Вставить("actions", МассивВзаимодействий);
	
	Возврат react_ОбщегоНазначения.МассивСтруктурВJSON(ОбщаяСтруктураВзаимодействий);
	
КонецФункции

//-
Функция ПолучитьДокументыЭлектронноеПисьмоИсходящее(Ссылка = Неопределено) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Встреча.Ссылка КАК uuid,
		|	Встреча.Номер КАК num,
		|	Встреча.Дата КАК date,
		|	Встреча.Автор КАК author,
		|	Встреча.Важность КАК importance,
		|	Встреча.ДатаНачала КАК date_beginning,
		|	Встреча.ДатаОкончания КАК date_ending,
		|	Встреча.МестоПроведенияВстречи КАК meeting_place,
		|	Встреча.Описание КАК description,
		|	Встреча.Ответственный КАК responsible,
		|	Встреча.СписокУчастников КАК members_list,
		|	Встреча.ВзаимодействиеОснование КАК actions_basis,
		|	Встреча.Тема КАК theme,
		|	Встреча.Комментарий КАК comment,
		|	Встреча.Представление КАК representation
		|ИЗ
		|	Документ.Встреча КАК Встреча";
		Если НЕ Ссылка = Неопределено Тогда
			Запрос.Текст = Запрос.Текст + "	
				|ГДЕ
				|	Встреча.Ссылка = &Ссылка
				|	И НЕ Встреча.ПометкаУдаления";	
			Запрос.УстановитьПараметр("Ссылка", Ссылка);
		КонецЕсли;
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	ОбщаяСтруктураВзаимодействий = Новый Структура;
	
	МассивВзаимодействий = Новый Массив;
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		СтруктураВзаимодействия = Новый Структура;
		
		СтруктураВзаимодействия.Вставить("uuid", XMLСтрока(ВыборкаДетальныеЗаписи.uuid));
		СтруктураВзаимодействия.Вставить("num", ВыборкаДетальныеЗаписи.num);
		СтруктураВзаимодействия.Вставить("date", Формат(ВыборкаДетальныеЗаписи.date, "ДЛФ=DT"));
		СтруктураВзаимодействия.Вставить("author", ВыборкаДетальныеЗаписи.author);
		СтруктураВзаимодействия.Вставить("importance", XMLСтрока(ВыборкаДетальныеЗаписи.importance));
		
		СтруктураВзаимодействия.Вставить("date_beginning", Формат(ВыборкаДетальныеЗаписи.date_beginning, "ДЛФ=DT"));
		СтруктураВзаимодействия.Вставить("date_ending", Формат(ВыборкаДетальныеЗаписи.date_ending, "ДЛФ=DT"));
		СтруктураВзаимодействия.Вставить("meeting_place", ВыборкаДетальныеЗаписи.meeting_place);
		СтруктураВзаимодействия.Вставить("description", ВыборкаДетальныеЗаписи.description);
		СтруктураВзаимодействия.Вставить("responsible", Строка(ВыборкаДетальныеЗаписи.responsible));
		СтруктураВзаимодействия.Вставить("members_list", ВыборкаДетальныеЗаписи.members_list);
		СтруктураВзаимодействия.Вставить("actions_basis", Строка(ВыборкаДетальныеЗаписи.actions_basis));	
		СтруктураВзаимодействия.Вставить("theme", ВыборкаДетальныеЗаписи.theme);		
		СтруктураВзаимодействия.Вставить("comment", ВыборкаДетальныеЗаписи.comment);
		СтруктураВзаимодействия.Вставить("representation", ВыборкаДетальныеЗаписи.representation);
		
		ТипДокумента = react_ОбщегоНазначения.ПолучитьТипВзаимодействия(ВыборкаДетальныеЗаписи.uuid);
		СтруктураВзаимодействия.Вставить("typeBack", ТипДокумента.typeBack);
		СтруктураВзаимодействия.Вставить("type", ТипДокумента.type);
		СтруктураВзаимодействия.Вставить("frontDocName", ТипДокумента.frontDocName);
		
		МассивВзаимодействий.Добавить(СтруктураВзаимодействия);
	КонецЦикла;
	
	ОбщаяСтруктураВзаимодействий.Вставить("actions", МассивВзаимодействий);
	
	Возврат react_ОбщегоНазначения.МассивСтруктурВJSON(ОбщаяСтруктураВзаимодействий);
	
КонецФункции

#КонецОбласти

#Область ЗаписьИСозданиеДокументов

Функция СоздатьОбновитьДокумент(Тело) Экспорт

	СтруктураТела = react_ОбщегоНазначения.ПолучитьСтруктуруИзJSON(Тело);
	
	Если СтруктураТела.typeBack = "Встреча" Тогда
		Возврат СоздатьОбновитьДокументВстреча(СтруктураТела);
	ИначеЕсли СтруктураТела.typeBack = "ЗапланированноеВзаимодействие" Тогда
		//Возврат СоздатьОбновитьДокументЗапланированноеВзаимодействие(СтруктураТела);
	ИначеЕсли СтруктураТела.typeBack = "СообщениеSMS" Тогда
		//Возврат СоздатьОбновитьДокументСообщениеSMS(СтруктураТела);
	ИначеЕсли СтруктураТела.typeBack = "ТелефонныйЗвонок" Тогда
		//Возврат СоздатьОбновитьДокументТелефонныйЗвонок(СтруктураТела);
	ИначеЕсли СтруктураТела.typeBack = "ЭлектронноеПисьмоВходящее" Тогда
		//Возврат СоздатьОбновитьДокументЭлектронноеПисьмоВходящее(СтруктураТела);
	ИначеЕсли СтруктураТела.typeBack = "ЭлектронноеПисьмоИсходящее" Тогда
		//Возврат СоздатьОбновитьДокументЭлектронноеПисьмоИсходящее(СтруктураТела);		
	КонецЕсли;

КонецФункции

Функция СоздатьОбновитьДокументВстреча(СтруктураТела)
	
	Если НЕ ЗначениеЗаполнено(СтруктураТела.uuid) Тогда
		Объект = Документы.Встреча.СоздатьДокумент();
	Иначе
		УникальныйИдентификатор = Новый УникальныйИдентификатор(СтруктураТела.uuid);
		Объект = Документы.Встреча.ПолучитьСсылку(УникальныйИдентификатор).ПолучитьОбъект();
	КонецЕсли;
	
	Объект.Дата 					= Дата(СтруктураТела.date);
	Объект.Автор 					= Справочники.Пользователи.НайтиПоНаименованию(СтруктураТела.author);
	Объект.Важность 				= react_ОбщегоНазначения.ПолучитьСсылкуНаВариантВажности(СтруктураТела.importance);
	Объект.ДатаНачала 				= Дата(СтруктураТела.date_beginning);
	Объект.ДатаОкончания 			= Дата(СтруктураТела.date_ending);
	Объект.МестоПроведенияВстречи 	= СтруктураТела.meeting_place;
	Объект.Описание 				= СтруктураТела.description;
	Объект.Ответственный 			= Справочники.Пользователи.НайтиПоНаименованию(СтруктураТела.responsible);
	
	ТипДокументаОснование 			= react_ОбщегоНазначения.ПолучитьТипВзаимодействияПоПредставлению(СтруктураТела.actions_basis_representation);
	Объект.ВзаимодействиеОснование 	= Документы[ТипДокументаОснование].ПолучитьСсылку(Новый УникальныйИдентификатор(СтруктураТела.actions_basis));
	
	Объект.Тема 					= СтруктураТела.theme;
	Объект.Комментарий 				= СтруктураТела.comment;
	
	Ответ = Новый Структура("status, error");
	КодСтатус = 500;
	Попытка
		Объект.Записать();
		
		КодСтатус = 200;
		Ответ.status = "success";
		Ответ.error = "no error";
	Исключение
		КодСтатус = 500;
		Ответ.status = "failed";
		Ответ.error = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
	КонецПопытки;
	
	Возврат Новый Структура("Тело, Код", react_ОбщегоНазначения.МассивСтруктурВJSON(Ответ), КодСтатус);
	
КонецФункции

Функция СоздатьОбновитьДокументЗапланированноеВзаимодействие(СтруктураТела)
КонецФункции

Функция СоздатьОбновитьДокументСообщениеSMS(СтруктураТела)
КонецФункции

Функция СоздатьОбновитьДокументТелефонныйЗвонок(СтруктураТела)
КонецФункции

Функция СоздатьОбновитьДокументЭлектронноеПисьмоВходящее(СтруктураТела)
КонецФункции

Функция СоздатьОбновитьДокументЭлектронноеПисьмоИсходящее(СтруктураТела)
КонецФункции

#КонецОбласти
